//打印1~10之间所有整数
/*
for(var i=1;i<=10;i++){
  console.log(i);
}
//练习：计算1~100之间所有整数的和
//var sum=0;
for(var i=1,sum=0;i<=100;i++){
  //i所有的整数
  sum+=i;
}
console.log(sum);
//练习：打印20~50所有的奇数
for(var i=20;i<=50;i++){
  if(i%2==1){//i是否满足奇数条件
    console.log(i);
  }
}
//练习：打印80,77,74....50
for(var i=80;i>=50;i-=3){
  console.log(i);
}
//练习：计算1~10之间所有整数的乘积
for(var i=1,sum=1;i<=10;i++){
  sum*=i;
}
console.log(sum);
//练习：打印本世纪(2000~2100)所有的闰年
for(var i=2000;i<=2100;i++){
  //判断i是否为闰年
  //四年一闰，百年不闰，四百年再闰
  if(i%4==0 && i%100!=0 || i%400==0){
    console.log(i);
  }
}
//练习：使用for循环打印5个*成一行
1*1=1
1*2=2 2*2=4
1*3=3 2*3=6 3*3=9
*
**
***
****
*****
//初始化一个变量是空字符
var str='';
for(var i=1;i<=5;i++){
  //console.log('*');
  //每次循环，把一个*加到str中
  str+='*';
}
console.log(str);
*/
//练习：打印99乘法表第5行
//1*5=5 2*5=10 3*5=15 4*5=20 5*5=25
//12345
var str='';
for(var i=1;i<=5;i++){
  str+=i+'*5='+(i*5)+' ';
}
console.log(str);






